---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeType.ResetExternallyTaggedGeometry
source: html/7303e22c-72da-9667-fdaf-521534c444f8.htm
---
# Autodesk.Revit.DB.DirectShapeType.ResetExternallyTaggedGeometry Method

Removes all of the externally tagged geometry in this DirectShapeType.

## Syntax (C#)
```csharp
public void ResetExternallyTaggedGeometry()
```